Revit 2027 API
SiteLocation.GeoCoordinateSystemId Property
 The geographic coordinate system ID, such as "AMG-50" and "Beijing1954/a.GK3d-40".
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GeoCoordinateSystemId { get; }
Public ReadOnly Property GeoCoordinateSystemId As String
	Get
public:
property String^ GeoCoordinateSystemId {
	String^ get ();
}
member GeoCoordinateSystemId : string with get
Property Value
String
Remarks
 If the site does not have a geographic coordinate system, it returns an empty string for this property.
See Also
Reference
SiteLocation Class
Autodesk.Revit.DB Namespace